{
  "title": "Kreo Owl Full HD 1080P 60 FPS Webcam with Auto-Focus and Built-in Dual Digital Mic, Plug and Play Setup for Video Call, Streaming, YouTube Built-in Privacy Shutter with 360 Rotation (Owl Full HD)",
  "description": "About this item\n💻 Smooth 1080P at 60 FPS: Elevate your video quality to the next level with 1080P at a silky-smooth 60 frames per second. Whether you're in a fast-paced online game, hosting a live stream, or engaged in a critical business meeting, our webcam delivers exceptional clarity and fluidity, ensuring your every movement is captured in lifelike detail for an immersive experience like never before.\n🎯 Auto-Focus Precision: Our webcam takes the guesswork out of staying sharp. With advanced auto-focus technology, it continuously tracks and adjusts, so you'll always appear crisp and in focus, whether you're in a fast-paced meeting or creating content, ensuring your every detail is captured with perfection.\n📐 Expansive 78-Degree Distortion-Free View: Enjoy a wider perspective without distortion or fisheye effects. Our webcam's 78-degree field of view ensures you can fit more into your frame without sacrificing image quality, making it perfect for group calls, presentations, and streaming, so you never miss a thing.\n🔊 Enhanced Sound Clarity with Dual Digital Mic: Enjoy crystal-clear audio in every conversation. Our webcam features dual digital microphones equipped with advanced background noise suppression technology, ensuring your voice takes center stage without distractions. Say goodbye to unwanted noise and experience professional-grade audio clarity for seamless video calls, streaming, and content creation.\n🔒 Enhanced Privacy with Built-In Shutter: Safeguard your personal space effortlessly. Our webcam boasts a built-in privacy shutter, allowing you to cover the lens when not in use, ensuring your privacy is always protected. Enjoy peace of mind and take control of your online presence.\n› See more product details",
  "images": [
    "https://m.media-amazon.com/images/I/41pfwVMaJDL._SL1500_SY300_QL70_FMwebp_.jpg"
  ],
  "top_reviews": [
    "(function() {\n            P.when('cr-A', 'ready').execute(function(A) {\n                if(typeof A.toggleExpanderAriaLabel === 'function') {\n                    A.toggleExpanderAriaLabel('review_text_read_more', 'Read more of this review', 'Read less of this review');\n                }\n            });\n        })();\n    \n    \n        .review-text-read-more-expander:focus-visible {\n            outline: 2px solid #2162a1;\n            outline-offset: 2px;\n            border-radius: 5px;\n        }\n    \n\n\n\n\n\n\n\n\n  \n  \n    Excellent Webcam, probably the best in the market at this price. Image and video quality is top notch.KREO is such a value for money brand with great quality.\n  \nRead more",
    "Excellent Webcam, probably the best in the market at this price. Image and video quality is top notch.KREO is such a value for money brand with great quality.",
    "I recently purchased the Kreo Owl facecam and I have been extremely impressed with its performance.Firstly, the design of the facecam is sleek and modern. It is also compact and lightweight, making it easy to transport and set up wherever I need it.One of the standout features of the Kreo Owl is its 1080p HD video quality.One of my favorite features of the Kreo Owl is the privacy cover. With just a simple slide, I can cover the camera lens when I am not using it. This gives me peace of mind knowing that I am in control of my privacy.Setting up the Kreo Owl was a breeze. It is compatible with both Windows and Mac operating systems and it was easy to install the necessary software. I also appreciate that it is plug-and-play, so I didn't have to spend a lot of time configuring it.Overall, I am extremely satisfied with my purchase of the Kreo Owl facecam. It has exceeded my expectations in terms of video and audio quality, design, and ease of use. I highly recommend it to anyone in need of a reliable and high-quality facecam for their video conferencing and streaming needs.\n  \nRead more",
    "I recently purchased the Kreo Owl facecam and I have been extremely impressed with its performance.Firstly, the design of the facecam is sleek and modern. It is also compact and lightweight, making it easy to transport and set up wherever I need it.One of the standout features of the Kreo Owl is its 1080p HD video quality.One of my favorite features of the Kreo Owl is the privacy cover. With just a simple slide, I can cover the camera lens when I am not using it. This gives me peace of mind knowing that I am in control of my privacy.Setting up the Kreo Owl was a breeze. It is compatible with both Windows and Mac operating systems and it was easy to install the necessary software. I also appreciate that it is plug-and-play, so I didn't have to spend a lot of time configuring it.Overall, I am extremely satisfied with my purchase of the Kreo Owl facecam. It has exceeded my expectations in terms of video and audio quality, design, and ease of use. I highly recommend it to anyone in need of a reliable and high-quality facecam for their video conferencing and streaming needs.",
    "I've been thoroughly impressed with its performance and features. The crisp 1080p resolution ensures that my video calls and recordings are always sharp and clear and also with the webcam's low-light performance which turned out to be exceptional as well. Even in dimly lit environments, the advanced light correction technology kicks in.Setting up the Kreo Owl is a breeze. It's plug-and-play functionality means I can quickly connect it to my computer or laptop without any hassle. Plus, it's compatible with a wide range of platforms and software, making it incredibly versatile.While it may not have all the fancy features of any other expensive webcams, the Kreo Owl delivers where it matters most: reliable performance, excellent video quality, and user-friendly design. Overall at this price range, I highly recommend it to anyone in need of a high-quality webcam for work, school, or leisure activities.\n  \nRead more"
  ],
  "return_feedback": [
    "Item not as described",
    "Wrong product",
    "Looked fake"
  ]
}